---
kind: property
id: P:Autodesk.Revit.DB.WorksetKindFilter.WorksetKind
source: html/865e3e7e-6761-3b44-2b44-d0f6fd03646b.htm
---
# Autodesk.Revit.DB.WorksetKindFilter.WorksetKind Property

The WorksetKind.

## Syntax (C#)
```csharp
public WorksetKind WorksetKind { get; }
```